## Plan Result (prod_shutter_webapp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 1 to change, 10 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;hwf-publicapp&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;hwf-staffapp&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;hwf-publicapp&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;hwf-staffapp&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;hwf-publicapp&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;hwf-staffapp&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;hwf-publicapp&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;hwf-staffapp&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;hwf-publicapp&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;hwf-staffapp&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-pfe&#34;]
* Delete
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;hwf-pet&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;hwf-staff-pet&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;hwf-pet&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;hwf-staff-pet&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;hwf-pet&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;hwf-staff-pet&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;hwf-pet&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;hwf-staff-pet&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;hwf-pet&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;hwf-staff-pet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "cname_record" {
      - fqdn                = "hwf-pet-shutter.helpwithcourtfees.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/CNAME/hwf-pet-shutter" -> null
      - name                = "hwf-pet-shutter" -> null
      - record              = "gray-pebble-060363703.3.azurestaticapps.net" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "helpwithcourtfees.service.gov.uk" -> null
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["hwf-publicapp"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "helpwithcourtfees.service.gov.uk-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "helpwithcourtfees-service-gov-uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "cname_record" {
      - fqdn                = "staff-shutter.helpwithcourtfees.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/CNAME/staff-shutter" -> null
      - name                = "staff-shutter" -> null
      - record              = "icy-moss-04729ee03.3.azurestaticapps.net" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "helpwithcourtfees.service.gov.uk" -> null
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["hwf-staffapp"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "staff.helpwithcourtfees.service.gov.uk-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "helpwithcourtfees-service-gov-uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 3600 -> 300
        # (3 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "zone_validate" {
      - fqdn                = "_dnsauth.helpwithcourtfees.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth" -> null
      - name                = "_dnsauth" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "helpwithcourtfees.service.gov.uk" -> null

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["hwf-publicapp"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.helpwithcourtfees.service.gov.uk"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "helpwithcourtfees-service-gov-uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "zone_validate" {
      - fqdn                = "_dnsauth.staff.helpwithcourtfees.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth.staff" -> null
      - name                = "_dnsauth.staff" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "helpwithcourtfees.service.gov.uk" -> null

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["hwf-staffapp"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staff.helpwithcourtfees.service.gov.uk"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "helpwithcourtfees-service-gov-uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_static_site" "swebapp" {
      - api_key             = (sensitive value) -> null
      - default_host_name   = "gray-pebble-060363703.3.azurestaticapps.net" -> null
      - id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-pet" -> null
      - location            = "westeurope" -> null
      - name                = "hwf-pet" -> null
      - resource_group_name = "cft-platform-shutter-webapp-prod-rg" -> null
      - sku_size            = "Standard" -> null
      - sku_tier            = "Standard" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
    }

  # module.static_webapp.azurerm_static_site.swebapp["hwf-publicapp"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "hwf-publicapp"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_static_site" "swebapp" {
      - api_key             = (sensitive value) -> null
      - default_host_name   = "icy-moss-04729ee03.3.azurestaticapps.net" -> null
      - id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-staff-pet" -> null
      - location            = "westeurope" -> null
      - name                = "hwf-staff-pet" -> null
      - resource_group_name = "cft-platform-shutter-webapp-prod-rg" -> null
      - sku_size            = "Standard" -> null
      - sku_tier            = "Standard" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
    }

  # module.static_webapp.azurerm_static_site.swebapp["hwf-staffapp"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "hwf-staffapp"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_static_site_custom_domain" "custom_domain" {
      - domain_name      = "helpwithcourtfees.service.gov.uk" -> null
      - id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-pet/customDomains/helpwithcourtfees.service.gov.uk" -> null
      - static_site_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-pet" -> null
      - validation_token = (sensitive value) -> null
      - validation_type  = "dns-txt-token" -> null
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["hwf-publicapp"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "helpwithcourtfees.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_static_site_custom_domain" "custom_domain" {
      - domain_name      = "staff.helpwithcourtfees.service.gov.uk" -> null
      - id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-staff-pet/customDomains/staff.helpwithcourtfees.service.gov.uk" -> null
      - static_site_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/hwf-staff-pet" -> null
      - validation_token = (sensitive value) -> null
      - validation_type  = "dns-txt-token" -> null
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["hwf-staffapp"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "staff.helpwithcourtfees.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2023-09-07 10:46:07 +0000 UTC" -> null
      - id              = "azure-shutter-pages:hwf_pet_prod" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "azure-shutter-pages" -> null
      - secret_name     = "hwf_pet_prod" -> null
      - updated_at      = "2023-09-07 10:46:07 +0000 UTC" -> null
    }

  # module.static_webapp.github_actions_secret.secret["hwf-publicapp"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "hwf_publicapp_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2023-09-07 10:46:11 +0000 UTC" -> null
      - id              = "azure-shutter-pages:hwf_staff_pet_prod" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "azure-shutter-pages" -> null
      - secret_name     = "hwf_staff_pet_prod" -> null
      - updated_at      = "2023-09-07 10:46:11 +0000 UTC" -> null
    }

  # module.static_webapp.github_actions_secret.secret["hwf-staffapp"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "hwf_staffapp_prod"
      + updated_at      = (known after apply)
    }

Plan: 10 to add, 1 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1747,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->